#include <ntddk.h>

/**
 * WFP（Windows Filter Platform，Windows过滤平台）
 * 微软希望用WFP来代替之前的Winsock LSP、TDI以及NDIS等网络过滤驱动
 * 开发者可以在WFP划分的不同分层进行过滤、重定向、修改等
 * 通过WFP，可以实现防火墙、入侵检测、网络监视、流量控制等
 * WFP本身包含用户态API和内核态API，在用户层也可以处理网络数据包，主要学习下内核层使用
 *
 * WFP框架结构：
 *
 *				套接字应用程序						第三方防火墙					Windows防火墙					传统IPSec策略服务
 *			   (Ws2_32.dll模块)														   (mpssvc)						  (Policyagent)
 *			      --------------------------------------------------------------------------------------------------------------
 *																		|
 *																C管理API(fwpuclnt.dll)
 *																		|
 *																		|
 *																		|
 *		RPC服务应用程序
 *		  RPC运行时    ----  分类API(fwpuclnt.dll) -------->	RPC接口---------------------------------------------------------
 *		 (rpcrt4.dll)											   |														   |
 * 																   |										用户态过滤引擎	   |
 * 																   |														   |
 * 																   |														   |
 * 																   |						基础过滤引擎					   |
 * 																   |														   | <----> IKE协议|AuthIP协议
 * 																   |	用户态RPC层											   |
 * 																   |										IKE以及IPSec层	   |
 * 																   |														   |
 * 												|----------------> |														   |<---------------|
 * 												|				   |														   |				|
 * 												|				   -------------------------------------------------------------				|
 * 用户态										|									 |															|
 * =============================================|====================================|==========================================================|==============
 * 内核态										|									 |															|
 *												|									 |															|
 * ---------TCP/IP协议栈					IPSec框架				|--------命令控制接口(IOCTL)------|					|---第三方---|		    |
 * 		    (tcpip.sys) |											|								  |					| 			 |			|
 * 					    |											|								  |					| 			 |			|
 * 				数据流分层垫片										|		  流/报文 数据分层		  |					| 反病毒	 |			|
 * 					    |											|								  |					| 			 |			|
 * 					    |											|								  |					| 			 |			|
 * 				ALE网络连接管理									    |		发送/接收 ALE分层		  |					| 并行控制	 |			|
 * 					    |											|								  |					| 			 |			|
 * 					    |					<---->			分类API	|								  |	呼出接口API  <->| 			 |<->WFP内核态客户端
 * 						|											|								  |					| 			 |	 (fwpkclnt.sys)
 * 				传输分层垫片 TCP/UDP								|		发送/接收 传输分层		  |					| 入侵检测	 |
 * 					    |											|								  |					| 			 |
 * 					    |											|								  |					| IPSec		 |
 * 					    |											|								  |					| 			 |
 * 				网络分层垫片 IPv4/IPv6							    |		发送/接收 IP分层		  |					| NAT		 |
 * 					    |											|								  |					| 			 |
 * ----------------------											-----------------------------------					--------------
 *																				内核过滤引擎
 *
 */

 /**
  *
  */

NTSTATUS DriverEntry(PDRIVER_OBJECT DriverObject, PUNICODE_STRING RegistryPath)
{
	return STATUS_SUCCESS;
}